# Estimate the unit sales of Walmart retail goods

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import openpyxl

In [2]:
item_details = pd.read_excel('archive/item_details.xlsx')
item_details.sample(10)

           item_id    category_of_item       class  perishable
763    item_619965          deli_items  class_2636           1
2104  item_1332103       personal_care  class_4114           0
1928  item_1239841         dairy_items  class_2170           1
1689  item_1146796       grocery_items  class_1040           0
206    item_255202       grocery_items  class_1045           0
895    item_724498       grocery_items  class_1028           0
1994  item_1246493       grocery_items  class_1016           0
1358   item_982726  cleaning_utilities  class_3018           0
2638  item_1464086           beverages  class_1144           0
2673  item_1464246           beverages  class_1148           0

In [3]:
location_details = pd.read_excel('archive/location_details.xlsx')
location_details.sample(10)

    location_id           city           state type  cluster
7    location_8      Bengaluru       Karnataka    D        8
33  location_34         Mumbai     Maharashtra    B        6
1    location_2      Bengaluru       Karnataka    D       13
2    location_3      Bengaluru       Karnataka    D        8
34  location_35  Visakhapatnam  Andhra Pradesh    C        3
47  location_48      Bengaluru       Karnataka    A       14
52  location_53        Chennai      Tamil Nadu    D       13
36  location_37      Hyderabad       Telangana    D        2
41  location_42      Hyderabad       Telangana    D        2
26  location_27         Mysore       Karnataka    D        1

In [4]:
sample_submission = pd.read_csv('archive/sample_submission.csv')
sample_submission.sample(10)

                id  unit_sales
19950732  20155183           0
5308738    5308738           0
6623934    6623934           0
235881      235881           0
23433032  23721233           0
17053852  17190233           0
10815799  10815799           0
17593110  17741792           0
362779      362779           0
2262843    2262843           0

In [5]:
test = pd.read_csv('archive/test.csv')
test.sample(10)

                id        date   locationId       item_id  onpromotion
18334428  18499806  2019-06-26  location_31  item_1981607        False
20272578  20484145  2019-07-15  location_18  item_1958268        False
641365      641365  2019-01-07  location_50  item_1047757        False
2215312    2215312  2019-01-23   location_5   item_315474        False
2784736    2784736  2019-01-28  location_40  item_1972138        False
4549419    4549419  2019-02-14  location_18  item_1937039        False
22030698  22284169  2019-08-01  location_24  item_2003389        False
2698508    2698508  2019-01-27  location_50   item_583925         True
11709528  11717456  2019-04-23  location_45   item_265672         True
18329045  18494423  2019-06-26  location_28  item_1394349        False

In [6]:
train_transactions = pd.read_excel('archive/train_transactions.xlsx')
train_transactions.sample(10)

            date location_identifier  transactions
20261 2016-03-14         location_16           785
13354 2015-10-16         location_19          1149
17976 2016-01-24         location_38          1672
44893 2017-08-10         location_10           824
20946 2016-03-28         location_49          2346
61209 2018-06-18         location_25           892
8071  2015-06-25         location_27          1052
70639 2018-12-16         location_44          5473
1631  2015-02-06         location_24          2532
15285 2015-11-26         location_26           509

In [7]:
train = pd.read_csv('archive/train.csv')
train.sample(10)

C:\Users\harib\AppData\Local\Temp\ipykernel_1552\4003363557.py:1: DtypeWarning: Columns (0: onpromotion) have mixed types. Specify dtype option on import or set low_memory=False.
  train = pd.read_csv('archive/train.csv')

                date   locationId       item_id  unit_sales onpromotion
12212459  2015-10-08   location_3   item_584246       9.813         NaN
11786625  2015-09-29   location_2   item_871421       6.000         NaN
21374052  2016-03-27  location_39  item_1239740       1.000         NaN
24509620  2016-05-28  location_37  item_1112450      13.000       False
84585729  2018-07-10  location_20  item_1260238       2.000       False
14680546  2015-11-29   location_8   item_105577       7.000         NaN
38312118  2016-12-28  location_11   item_830797       3.000       False
21410954  2016-03-28  location_13  item_1346643       1.000         NaN
16407882  2016-01-03  location_11   item_414455       6.000         NaN
13193531  2015-10-29  location_24   item_519560       2.244         NaN

In [8]:
print(f"Item details shape: {item_details.shape}")
print(f"Location details shape: {location_details.shape}")
print(f"Sample submission shape: {sample_submission.shape}")
print(f"Test data shape: {test.shape}")
print(f"Train transactions shape: {train_transactions.shape}")
print(f"Train data shape: {train.shape}")

Item details shape: (4100, 4)
Location details shape: (54, 5)
Sample submission shape: (23517680, 2)
Test data shape: (23517680, 5)
Train transactions shape: (71391, 3)
Train data shape: (101688779, 5)

In [9]:
print(f"Item details columns: {item_details.columns}")
print(f"Location details columns: {location_details.columns}")
print(f"Sample submission columns: {sample_submission.columns}")
print(f"Test data columns: {test.columns}")
print(f"Train transactions columns: {train_transactions.columns}")
print(f"Train data columns: {train.columns}")

Item details columns: Index(['item_id', 'category_of_item', 'class', 'perishable'], dtype='str')
Location details columns: Index(['location_id', 'city', 'state', 'type', 'cluster'], dtype='str')
Sample submission columns: Index(['id', 'unit_sales'], dtype='str')
Test data columns: Index(['id', 'date', 'locationId', 'item_id', 'onpromotion'], dtype='str')
Train transactions columns: Index(['date', 'location_identifier', 'transactions'], dtype='str')
Train data columns: Index(['date', 'locationId', 'item_id', 'unit_sales', 'onpromotion'], dtype='str')

In [10]:
print(len(train['item_id'].unique()))
print(len(train['locationId'].unique()))

3890
53

In [11]:
train.info()

<class 'pandas.DataFrame'>
RangeIndex: 101688779 entries, 0 to 101688778
Data columns (total 5 columns):
 #   Column       Dtype
---  ------       -----
 0   date         str
 1   locationId   str
 2   item_id      str
 3   unit_sales   float64
 4   onpromotion  object
dtypes: float64(1), object(1), str(3)
memory usage: 3.8+ GB

In [12]:
test.info()

<class 'pandas.DataFrame'>
RangeIndex: 23517680 entries, 0 to 23517679
Data columns (total 5 columns):
 #   Column       Dtype
---  ------       -----
 0   id           int64
 1   date         str
 2   locationId   str
 3   item_id      str
 4   onpromotion  bool
dtypes: bool(1), int64(1), str(3)
memory usage: 740.1 MB

In [16]:
train.duplicated().sum()

np.int64(10044)

In [17]:
test.duplicated().sum()

np.int64(0)

In [18]:
train.isnull().sum()

date                  0
locationId            0
item_id               0
unit_sales            0
onpromotion    21657651
dtype: int64

In [19]:
test.isnull().sum()

id             0
date           0
locationId     0
item_id        0
onpromotion    0
dtype: int64